/*const menuLinks = document.getElementsByClassName('menu_link');
if (menuLinks.length>0) {
    menuLinks.forEach(menuLinks => {
        menuLinks.addEventListener("onClick", onMenuLinkClick);

    });

    function onMenuLinkClick(e) {
        var menu = document.getElementById('id_menu_list');
        menu.style.display = 'none';
        
    }
}
*/
console.log(`
общее количество баллов: 140 из 160.
вёрстка валидная +10
вёрстка семантическая +20
Есть: figure, figcaption, footer, header, main, nav, section, используются заголовки h1, h2, h3.
для оформления СV используются css-стили +10
контент размещается в блоке, который горизонтально центрируется на странице. 
Фоновый цвет, если он есть, тянется во всю ширину страницы +10
вёрстка адаптивная: ни на одном из разрешений экрана до 320px включительно не появляется горизонтальная полоса прокрутки, при этом всё содержание страницы сохраняется +10
есть адаптивное бургер-меню. +0
на странице СV присутствует изображение - фото или аватарка автора CV, пропорции изображения не искажены, у изображения есть атрибут alt (может быть пустым) +10
контакты для связи и перечень навыков оформлены в виде списка ul > li +10
CV содержит контакты для связи, краткую информацию о себе, перечень навыков, информацию об образовании и уровне английского +10
CV содержит пример вашего кода (например, решение задачи с сайта codewars) с подсветкой кода. Для подсветки кода может использоваться js-библиотека, например, highlight.js +10
CV содержит изображения-ссылки на выполненные вами проекты. При клике по изображению страница проекта открывается в новой вкладке. У каждого проекта есть название, небольшое описание, указан перечень используемых технологий. +10
CV выполнено на английском языке +10
выполнены требования к Pull Request: есть ссылка на задание, скриншот страницы СV, ссылка на деплой страницы CV на GitHub Pages, выполнена самооценка (самооценку расписываем по пунктам критериев оценки, указывая балл за каждый пункт) +10

есть видеорезюме автора CV на английском языке. Видеорезюме встраивается в страницу CV как видео, а не в виде кнопки или ссылки. Продолжительность видео 3-5 минут (±15 секунд). В описание видео на YouTube добавлена ссылка на его транскрипцию на английском языке (например, в документе Google Docs). +0
Вниманию авторов работы. Убедитесь, что видео проигрывается и ссылка на транскрипцию открывается в режиме инкогнито браузера.
дизайн, оформление, качество выполнения CV не ниже чем в примерах CV, приведённых в материалах к заданию (это дополнительные 10 баллов, поэтому некоторый субъективизм в оценке может присутствовать) +10`);